tinyvision-ai-inc/pico-ice-sdk/example/micro_ros_ws/src/pico-sdk/lib/tinyusb/hw/mcu/nuvoton/nuc121_125/StdDriver/src/spi_i2s.c
    /* Configure I2S controller */
    i2s->I2SCTL = u32MasterSlave | u32WordWidth | u32Channels | u32DataFormat;
    /* Set TX and RX FIFO threshold to middle value */
    i2s->FIFOCTL = I2S_FIFO_TX_LEVEL_WORD_2 | I2S_FIFO_RX_LEVEL_WORD_2;

    if (u32MasterSlave == SPI_MASTER)
    {
        /* Get the source clock rate */
        u32SrcClk = I2S_GetSourceClockFreq(i2s);

        /* Calculate the bit clock rate */
        u32BitRate = u32SampleRate * ((u32WordWidth >> SPI_I2SCTL_WDWIDTH_Pos) + 1) * 16;
        u32Divider = (((((u32SrcClk * 10 / u32BitRate)) >> 1) + 5) / 10) - 1;
        /* Set BCLKDIV setting */
        i2s->I2SCLK = (i2s->I2SCLK & ~SPI_I2SCLK_BCLKDIV_Msk) | (u32Divider << SPI_I2SCLK_BCLKDIV_Pos);

        /* Calculate bit clock rate */
        u32BitRate = u32SrcClk / ((u32Divider + 1) * 2);
        /* Calculate real sample rate */
        u32SampleRate = u32BitRate / (((u32WordWidth >> SPI_I2SCTL_WDWIDTH_Pos) + 1) * 16);

        /* Enable TX function, RX function and I2S mode. */
        i2s->I2SCTL |= (SPI_I2SCTL_RXEN_Msk | SPI_I2SCTL_TXEN_Msk | SPI_I2SCTL_I2SEN_Msk);

        /* Return the real sample rate */
        return u32SampleRate;
    }
    else
    {
        /* Set BCLKDIV = 0 */
        i2s->I2SCLK &= ~SPI_I2SCLK_BCLKDIV_Msk;
        /* Get system clock frequency */
        u32HCLKFreq = CLK_GetHCLKFreq();

        /* Set the peripheral clock rate to equal APB clock rate */
        CLK->CLKSEL2 = (CLK->CLKSEL2 & (~CLK_CLKSEL2_SPI0SEL_Msk)) | CLK_CLKSEL2_SPI0SEL_PCLK0;
        /* Enable TX function, RX function and I2S mode. */
        i2s->I2SCTL |= (SPI_I2SCTL_RXEN_Msk | SPI_I2SCTL_TXEN_Msk | SPI_I2SCTL_I2SEN_Msk);

        /* Return slave peripheral clock rate */
        if ((CLK->CLKSEL0 & CLK_CLKSEL0_PCLK0SEL_Msk) == CLK_CLKSEL0_PCLK0SEL_HCLK_DIV2)
            return (u32HCLKFreq / 2);
        else
            return u32HCLKFreq;
    }
}

/**
  * @brief  Disable I2S function.
  * @param[in]  i2s The pointer of the specified I2S module.
  * @return None
  * @details Disable I2S function.
  */
void I2S_Close(SPI_T *i2s)
{
    i2s->I2SCTL &= ~SPI_I2SCTL_I2SEN_Msk;
}

/**
  * @brief Enable interrupt function.
  * @param[in] i2s The pointer of the specified I2S module.
  * @param[in] u32Mask The combination of all related interrupt enable bits.
  *            Each bit corresponds to a interrupt source. Valid values are listed below.
  *            - \ref I2S_FIFO_TXTH_INT_MASK
  *            - \ref I2S_FIFO_RXTH_INT_MASK
  *            - \ref I2S_FIFO_RXOV_INT_MASK
  *            - \ref I2S_FIFO_RXTO_INT_MASK
  *            - \ref I2S_TXUF_INT_MASK
  *            - \ref I2S_RIGHT_ZC_INT_MASK
  *            - \ref I2S_LEFT_ZC_INT_MASK
  * @return None
  * @details This function enables the interrupt according to the u32Mask parameter.
  */
void I2S_EnableInt(SPI_T *i2s, uint32_t u32Mask)
{
    /* Enable TX threshold interrupt flag */
    if ((u32Mask & I2S_FIFO_TXTH_INT_MASK) == I2S_FIFO_TXTH_INT_MASK)
        i2s->FIFOCTL |= SPI_FIFOCTL_TXTHIEN_Msk;

    /* Enable RX threshold interrupt flag */
    if ((u32Mask & I2S_FIFO_RXTH_INT_MASK) == I2S_FIFO_RXTH_INT_MASK)
        i2s->FIFOCTL |= SPI_FIFOCTL_RXTHIEN_Msk;

    /* Enable RX overrun interrupt flag */
    if ((u32Mask & I2S_FIFO_RXOV_INT_MASK) == I2S_FIFO_RXOV_INT_MASK)
        i2s->FIFOCTL |= SPI_FIFOCTL_RXOVIEN_Msk;

    /* Enable RX time-out interrupt flag */
    if ((u32Mask & I2S_FIFO_RXTO_INT_MASK) == I2S_FIFO_RXTO_INT_MASK)
        i2s->FIFOCTL |= SPI_FIFOCTL_RXTOIEN_Msk;

    /* Enable TX underflow interrupt flag */
    if ((u32Mask & I2S_TXUF_INT_MASK) == I2S_TXUF_INT_MASK)
        i2s->FIFOCTL |= SPI_FIFOCTL_TXUFIEN_Msk;

    /* Enable right channel zero cross interrupt flag */
    if ((u32Mask & I2S_RIGHT_ZC_INT_MASK) == I2S_RIGHT_ZC_INT_MASK)
        i2s->I2SCTL |= SPI_I2SCTL_RZCIEN_Msk;

    /* Enable left channel zero cross interrupt flag */
    if ((u32Mask & I2S_LEFT_ZC_INT_MASK) == I2S_LEFT_ZC_INT_MASK)
        i2s->I2SCTL |= SPI_I2SCTL_LZCIEN_Msk;
}

/**
  * @brief Disable interrupt function.
  * @param[in] i2s The pointer of the specified I2S module.
  * @param[in] u32Mask The combination of all related interrupt enable bits.
  *            Each bit corresponds to a interrupt source. Valid values are listed below.
  *            - \ref I2S_FIFO_TXTH_INT_MASK
  *            - \ref I2S_FIFO_RXTH_INT_MASK
  *            - \ref I2S_FIFO_RXOV_INT_MASK
  *            - \ref I2S_FIFO_RXTO_INT_MASK
  *            - \ref I2S_TXUF_INT_MASK
  *            - \ref I2S_RIGHT_ZC_INT_MASK
  *            - \ref I2S_LEFT_ZC_INT_MASK
  * @return None
  * @details This function disables the interrupt according to the u32Mask parameter.
  */
void I2S_DisableInt(SPI_T *i2s, uint32_t u32Mask)
{
    /* Disable TX threshold interrupt flag */
    if ((u32Mask & I2S_FIFO_TXTH_INT_MASK) == I2S_FIFO_TXTH_INT_MASK)
        i2s->FIFOCTL &= ~SPI_FIFOCTL_TXTHIEN_Msk;

    /* Disable RX threshold interrupt flag */
    if ((u32Mask & I2S_FIFO_RXTH_INT_MASK) == I2S_FIFO_RXTH_INT_MASK)
        i2s->FIFOCTL &= ~SPI_FIFOCTL_RXTHIEN_Msk;

    /* Disable RX overrun interrupt flag */
    if ((u32Mask & I2S_FIFO_RXOV_INT_MASK) == I2S_FIFO_RXOV_INT_MASK)
        i2s->FIFOCTL &= ~SPI_FIFOCTL_RXOVIEN_Msk;

    /* Disable RX time-out interrupt flag */
    if ((u32Mask & I2S_FIFO_RXTO_INT_MASK) == I2S_FIFO_RXTO_INT_MASK)
        i2s->FIFOCTL &= ~SPI_FIFOCTL_RXTOIEN_Msk;

    /* Disable TX underflow interrupt flag */
    if ((u32Mask & I2S_TXUF_INT_MASK) == I2S_TXUF_INT_MASK)
        i2s->FIFOCTL &= ~SPI_FIFOCTL_TXUFIEN_Msk;

    /* Disable right channel zero cross interrupt flag */
    if ((u32Mask & I2S_RIGHT_ZC_INT_MASK) == I2S_RIGHT_ZC_INT_MASK)
        i2s->I2SCTL &= ~SPI_I2SCTL_RZCIEN_Msk;

    /* Disable left channel zero cross interrupt flag */
    if ((u32Mask & I2S_LEFT_ZC_INT_MASK) == I2S_LEFT_ZC_INT_MASK)
        i2s->I2SCTL &= ~SPI_I2SCTL_LZCIEN_Msk;
}

/**
  * @brief  Enable master clock (MCLK).
  * @param[in] i2s The pointer of the specified I2S module.
  * @param[in] u32BusClock The target MCLK clock rate.
  * @return Actual MCLK clock rate
  * @details Set the master clock rate according to u32BusClock parameter and enable master clock output.
  *          The actual master clock rate may be different from the target master clock rate. The real master clock rate will be returned for reference.
  */
uint32_t I2S_EnableMCLK(SPI_T *i2s, uint32_t u32BusClock)
{
    uint32_t u32Divider;
    uint32_t u32SrcClk;

    u32SrcClk = I2S_GetSourceClockFreq(i2s);

    if (u32BusClock == u32SrcClk)
        u32Divider = 0;
    else
    {
        u32Divider = (u32SrcClk / u32BusClock) >> 1;

        /* MCLKDIV is a 6-bit width configuration. The maximum value is 0x3F. */
        if (u32Divider > 0x3F)
            u32Divider = 0x3F;
    }

